USER_CMD_DESCRIPTION = "👤 Информация о пользователе"
PIG_CMD_DESCRIPTION = "🐷 Информация о хряке"
FEED_CMD_DESCRIPTION = "🐷 Покормить хряка"
NAME_CMD_DESCRIPTION = "🐷 Изменить имя хряка"
TOP_CMD_DESCRIPTION = "🐷 Топ 10 хряков по жировой массе"
REPORT_CMD_DESCRIPTION = "🐖 Жалоба на пользователя"

NAME = "Имя"
UID = "UID"
WEIGHT = "Вес"
AGE = "Возраст"
DAYS = "дн."
KG = "кг."

TOP_10 = "🐷 ТОП 10"

PIG_PROFILE = "Профиль Хряка"

NAME_NOT_FOUND = "😢 Хряк с таким именем - не найден."
WEIGHT_CHANGE_PLUS = 'Ваш хряк пожирнел на **{} кг** 😎'
WEIGHT_CHANGE_SAME = 'Масса вашего хряка не изменилась... 🐷'
WEIGHT_CHANGE_MINUS = 'Ваш хряк похудел на **{} кг** 😢'

SAME_NAME = "🤨 Вы уже дали такое-же имя своему хряку."
NAME_ALREADY_EXISTS = "Имя `{}` уже занято 😢"
PIG_CREATED = "✅ Вы успешно создали хряка с именем `{}`"
NAME_CHANGED = "☑️ Вы успешно сменили имя своего хряка с `{0}` на `{1}`."

REPORT_SUCCESS = "☑️ Репорт успешно отправлен, спасибо!"