USER_CMD_DESCRIPTION = "👤 Інформація щодо користувача"
PIG_CMD_DESCRIPTION = "🐷 Інформація про конкретного хряка"
FEED_CMD_DESCRIPTION = "🐷 Покормити хряка"
NAME_CMD_DESCRIPTION = "🐷 Змінити ім'я хряка"
TOP_CMD_DESCRIPTION = "🐷 Топ 10 хряків за сальною масою"
REPORT_CMD_DESCRIPTION = "🐖 Скарга на користувача"

NAME = "Ім'я"
UID = "UID"
WEIGHT = "Вага"
AGE = "Вік"
DAYS = "дн."
KG = "кг."

TOP_10 = "🐷 ТОП 10"

PIG_PROFILE = "Профіль Хряка"

NAME_NOT_FOUND = "😢 Хряк з таким іменем - не знайдений."
WEIGHT_CHANGE_PLUS = 'Ваш хряк нагнав салової маси на **{} кг** 😎'
WEIGHT_CHANGE_SAME = 'Маса вашого хряка не змінилася... 🐷'
WEIGHT_CHANGE_MINUS = 'Ваш хряк скинув салової маси на **{} кг** 😢'

SAME_NAME = "🤨 Ви вже дали таке саме ім'я свому хряку."
NAME_ALREADY_EXISTS = "Ім'я `{}` вже зайняте 😢"
PIG_CREATED = "✅ Ви успішно створили хряка з іменем `{}`"
NAME_CHANGED = "☑️ Ви успішно змінили ім'я свого хряка з `{0}` на `{1}`."

REPORT_SUCCESS = "☑️ Репорт успішно відправлено, дякуємо!"